minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
    char msg[len + 1];

    if (info->final && info->index == 0 && info->len == len)
    {
      //the whole message is in a single frame and we got all of it's data
      DEBUGLOG("ws[%s][%u] %s-message[%u]: ", server->url(), client->id(), (info->opcode == WS_TEXT) ? "text" : "binary", (uint32_t)info->len);

      if (info->opcode == WS_TEXT)
      {
        Serial.print("case A ");
        for (size_t i = 0; i < info->len; i++)
        {
          msg[i] = (char)data[i];
        }
      }
      else
      {
        Serial.print("case B ");
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      // msg[len + 1] = '\0';
      msg[len] = '\0';
      DEBUGASYNCWS("%s\r\n", msg);

      if (info->opcode == WS_TEXT)
      {
        client->text(FPSTR(pgm_txt_gotyourtextmessage));
      }
      else
      {
        client->binary(FPSTR(pgm_txt_gotyourbinarymessage));
      }
    }
    else
    {
      //message is comprised of multiple frames or the frame is split into multiple packets
      if (info->index == 0)
      {
        if (info->num == 0)
          DEBUGASYNCWS("ws[%s][%u] %s-message start\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
        DEBUGASYNCWS("ws[%s][%u] frame[%u] start[%llu]\r\n", server->url(), client->id(), info->num, info->len);
      }

      DEBUGASYNCWS("ws[%s][%u] frame[%u] %s[%llu - %llu]: ", server->url(), client->id(), info->num, (info->message_opcode == WS_TEXT) ? "text" : "binary", info->index, info->index + len);

      if (info->opcode == WS_TEXT)
      {
        Serial.print("case C ");
        for (size_t i = 0; i < info->len; i++)
        {
          msg[i] = (char)data[i];
        }
      }
      else
      {
        Serial.print("case D ");
        char buff[3];
        for (size_t i = 0; i < info->len; i++)
        {
          sprintf(buff, "%02x ", (uint8_t)data[i]);
          if (i == 0)
          {
            strcpy(msg, buff);
          }
          else
          {
            strcat(msg, buff);
          }
        }
      }
      msg[len] = '\0';
      DEBUGASYNCWS("%s\r\n", msg);

      if ((info->index + len) == info->len)
      {
        DEBUGASYNCWS("ws[%s][%u] frame[%u] end[%llu]\r\n", server->url(), client->id(), info->num, info->len);
        if (info->final)
        {
          DEBUGASYNCWS("ws[%s][%u] %s-message end\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
          if (info->message_opcode == WS_TEXT)
            client->text(pgm_txt_gotyourtextmessage);
          else
            client->binary(pgm_txt_gotyourbinarymessage);
        }
      }
    }

    if (strncmp_P(msg, pgm_schedulepagesholat, strlen_P(pgm_schedulepagesholat)) == 0)
    {
      clientVisitSholatTimePage = true;
      sendSholatSchedule(2);
    }
    else if (strncmp_P(msg, pgm_settimepage, strlen_P(pgm_settimepage)) == 0)
    {
      clientVisitSetTimePage = true;
      sendDateTime(2);
    }
    else if (strncmp_P(msg, pgm_statuspagesystem, strlen_P(pgm_statuspagesystem)) == 0)
    {
      clientVisitStatusSystemPage = true;
    }
    else if (strncmp_P(msg, pgm_configpageledmatrix, strlen_P(pgm_configpageledmatrix)) == 0)
    {
      clientVisitConfigRunningLedPage = true;
    }
    else if (strncmp_P(msg, pgm_configpagemqtt, strlen_P(pgm_configpagemqtt)) == 0)
    {
      clientVisitConfigMqttPage = true;
    }
    else if (strncmp_P(msg, pgm_statuspagetime, strlen_P(pgm_statuspagetime)) == 0)
    {
      clientVisitStatusTimePage = true;
      // sendTimeStatus(2);
    }
    else if (strncmp_P(msg, pgm_statuspagenetwork, strlen_P(pgm_statuspagenetwork)) == 0)
    {
      clientVisitStatusNetworkPage = true;
      // sendNetworkStatus(2);
    }
    else if (data[0] == '{')
    {
      StaticJsonBuffer<1024> jsonBuffer;
      JsonObject &root = jsonBuffer.parseObject(data);

      if (!root.success())
      {
        return;
      }

      //***********************
      // handle long text JSON
      //***********************
      if (root[FPSTR(pgm_longtext)].success())
      {
        const char *longtext = root[FPSTR(pgm_longtext)];

        File file = SPIFFS.open(RUNNING_TEXT_FILE, "w");

        if (!file)
        {
          DEBUGASYNCWS("Failed to open MQTT_PUBSUB config file\r\n");
          file.close();
          return;
        }

        for (uint16_t j = 0; j < strlen(longtext); j++)
        {
          file.write(longtext[j]);
        }
        file.close();
        tone1 = HIGH;
      }

      //******************************
      // handle SAVE CONFIG (not fast)
      //******************************
      if (root[FPSTR(pgm_saveconfig)].success())
      {

        const char *saveconfig = root[FPSTR(pgm_saveconfig)];
        //int len = root[FPSTR(pgm_saveconfig)].measureLength();

        //remove json key before saving
        root.remove(FPSTR(pgm_saveconfig));

        //******************************
        // save LOCATION config
        //******************************
        if (strcmp_P(saveconfig, pgm_configpagelocation) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "w");

          if (!file)
          {
            DEBUGASYNCWS("Failed to open LOCATION config file\r\n");
            file.close();
            return;
          }

          root.prettyPrintTo(file);
          file.flush();
          file.close();

          configFileLocationUpdated = true;

          //beep
          tone1 = HIGH;
        }
        //******************************
        // save NETWORK config
        //******************************
        else if (strcmp_P(saveconfig, pgm_configpagenetwork) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "w");

          if (!file)
          {
            DEBUGASYNCWS("Failed to open NETWORK config file\r\n");
            file.close();
            return;
          }

          root.prettyPrintTo(file);
          file.flush();
          file.close();

          load_config_network();
          configFileNetworkUpdatedFlag = true;

