minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
          //beep
          tone1 = HIGH;
        }
        //******************************
        // save TIME config
        //******************************
        else if (strcmp_P(saveconfig, pgm_configpagetime) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfiletime), "w");

          if (!file)
          {
            DEBUGASYNCWS("Failed to open TIME config file\r\n");
            file.close();
            return;
          }

          root.prettyPrintTo(file);
          file.flush();
          file.close();

          load_config_time();
          process_sholat();

          //beep
          tone1 = HIGH;
        }
        //******************************
        // save SHOLAT config
        //******************************
        else if (strcmp_P(saveconfig, pgm_configpagesholat) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfilesholat), "w");

          if (!file)
          {
            DEBUGASYNCWS("Failed to open SHOLAT config file\r\n");
            file.close();
            return;
          }

          root.prettyPrintTo(file);
          file.flush();
          file.close();

          load_config_sholat();
          process_sholat();

          //beep
          tone1 = HIGH;
        }
        //******************************
        // save LED MATRIX config
        //******************************
        else if (strcmp_P(saveconfig, pgm_configpageledmatrix) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "w");

          if (!file)
          {
            DEBUGASYNCWS("Failed to open LED MATRIX config file\r\n");
            file.close();
            return;
          }

          root.prettyPrintTo(file);
          file.flush();
          file.close();

          load_config_ledmatrix();

          //beep
          tone1 = HIGH;
        }
        //******************************
        // save Mqtt config
        //******************************
        else if (strcmp_P(saveconfig, pgm_configpagemqtt) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfilemqtt), "w");

          if (!file)
          {
            DEBUGASYNCWS("Failed to open MQTT config file\r\n");
            file.close();
            return;
          }

          root.prettyPrintTo(file);
          file.flush();
          file.close();

          load_config_mqtt();

          //beep
          tone1 = HIGH;
        }

        //******************************
        // save MqttPubSub config
        //******************************
        else if (strcmp_P(saveconfig, pgm_configpagemqttpubsub) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfilemqttpubsub), "w");

          if (!file)
          {
            DEBUGASYNCWS("Failed to open MQTT_PUBSUB config file\r\n");
            file.close();
            return;
          }

          root.prettyPrintTo(file);
          file.flush();
          file.close();

          //beep
          tone1 = HIGH;
        }

        return;
      }

      //saveFastConfig; for led matrix settings page
      if (root[FPSTR(pgm_type)].success())
      {

        const char *type = root[FPSTR(pgm_type)];
        // int len = strlen(type);

        if (strcmp_P(type, pgm_matrixConfig) == 0)
        {

          const char *param = root[FPSTR(pgm_param)];
          const char *value = root[FPSTR(pgm_value)];
          // const char* text = root[FPSTR(pgm_text)];

          //int len = strlen(param);
          //int lenValue = strlen(value);

          if (strcmp_P(param, pgm_operatingmode) == 0)
          {
            if (atoi(value) == 0)
            {
              _ledMatrixSettings.operatingmode = Normal;
            }
            else if (atoi(value) == 1)
            {
              _ledMatrixSettings.operatingmode = Config;
            }
            else if (atoi(value) == 2)
            {
              _ledMatrixSettings.operatingmode = Edit;
            }
            MODE = _ledMatrixSettings.operatingmode;
          }
          if (strcmp_P(param, pgm_pagemode0) == 0)
          {
            _ledMatrixSettings.pagemode0 = atoi(value);
            currentPageMode0 = _ledMatrixSettings.pagemode0;
          }
          if (strcmp_P(param, pgm_pagemode1) == 0)
          {
            _ledMatrixSettings.pagemode1 = atoi(value);
            currentPageMode1 = _ledMatrixSettings.pagemode1;
          }
          if (strcmp_P(param, pgm_pagemode2) == 0)
          {
            _ledMatrixSettings.pagemode2 = atoi(value);
            currentPageMode2 = _ledMatrixSettings.pagemode2;
          }
          if (strcmp_P(param, pgm_pagemode) == 0)
          {
            if (strcmp_P(value, pgm_automatic) == 0)
            {
              _ledMatrixSettings.pagemode = Automatic;
            }
            if (strcmp_P(value, pgm_manual) == 0)
            {
              _ledMatrixSettings.pagemode = Manual;
            }
          }
          if (strcmp_P(param, pgm_scrollrow_0) == 0)
          {
            if (strcmp_P(value, pgm_true) == 0)
            {
              _ledMatrixSettings.scrollrow_0 = 1;
            }
            else
            {
              _ledMatrixSettings.scrollrow_0 = 0;
            }
          }
          if (strcmp_P(param, pgm_scrollrow_1) == 0)
          {
            if (strcmp_P(value, pgm_true) == 0)
            {
              _ledMatrixSettings.scrollrow_1 = 1;
            }
            else
            {
              _ledMatrixSettings.scrollrow_1 = 0;
            }
          }
          if (strcmp_P(param, pgm_scrollspeedslider) == 0)
          {
            _ledMatrixSettings.scrollspeed = atoi(value);
          }
          if (strcmp_P(param, pgm_brightnessslider) == 0)
          {
            //_ledMatrixSettings.brightness = value.toInt();
            _ledMatrixSettings.brightness = atoi(value);
          }
          if (strcmp_P(param, pgm_longtext) == 0)
          {
            File runningTextFile = SPIFFS.open(RUNNING_TEXT_FILE, "w");
            for (uint16_t j = 0; j < strlen(value); j++)
            {
              runningTextFile.write(value[j]);
            }
            runningTextFile.close();
            tone1 = HIGH;
          }
          if (strcmp_P(param, pgm_btntesttone0) == 0)
          {
            tone0 = HIGH;
          }
          if (strcmp_P(param, pgm_btntesttone1) == 0)
          {
            tone1 = HIGH;
          }
          if (strcmp_P(param, pgm_btntesttone2) == 0)
          {
            alarmState = HIGH;
          }
          if (strcmp_P(param, pgm_btntesttone10) == 0)
          {
            tone10 = HIGH;
          }
          if (strcmp_P(param, pgm_btnsaveconfig) == 0)
          {
            // config_save_runnningled();
            tone1 = HIGH;
          }
        }
      }
    }
  }
}

void AsyncWSBegin()
{
  DEBUGASYNCWS("Async WebServer Init...\r\n");

  // Register wifi Event to control connection LED
  onStationModeConnectedHandler = WiFi.onStationModeConnected([](WiFiEventStationModeConnected data) {
    onWiFiConnected(data);
  });
  onStationModeGotIPHandler = WiFi.onStationModeGotIP([](WiFiEventStationModeGotIP data) {
    onWifiGotIP(data);
  });
  // onStationModeGotIPHandler = WiFi.onStationModeGotIP(onWifiGotIP);
  onStationModeDisconnectedHandler = WiFi.onStationModeDisconnected([](WiFiEventStationModeDisconnected data) {
    onWiFiDisconnected(data);
  });

  // Register event handlers.
  // Callback functions will be called as long as these handler objects exist.
  // Call "onStationConnected" each time a station connects
  stationConnectedHandler = WiFi.onSoftAPModeStationConnected(&onStationConnected);
  // Call "onStationDisconnected" each time a station disconnects
  stationDisconnectedHandler = WiFi.onSoftAPModeStationDisconnected(&onStationDisconnected);
  // Call "onProbeRequestPrint" and "onProbeRequestBlink" each time
  // a probe request is received.
  // Former will print MAC address of the station and RSSI to Serial,
  // latter will blink an LED.
  probeRequestPrintHandler = WiFi.onSoftAPModeProbeRequestReceived(&onProbeRequestPrint);
  probeRequestBlinkHandler = WiFi.onSoftAPModeProbeRequestReceived(&onProbeRequestBlink);

  int reading = analogRead(A0);
  DEBUGASYNCWS("Analog Read: %d\r\n", reading);
  if (reading >= 768)
  {                            // analog read 3 volts or more
    _configAP.APenable = true; // Read AP button. If button is pressed, activate AP
    DEBUGASYNCWS("AP Enable = %d\r\n", _configAP.APenable);
  }

  //  if (!_fs) // If SPIFFS is not started
  //    _fs->begin();

