minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  // SPIFFS.format();

  SPIFFS.begin();

  SPIFFS.info(fs_info);

  PRINT("totalBytes: %u\r\n", fs_info.totalBytes);
  PRINT("usedBytes: %u\r\n", fs_info.usedBytes);
  PRINT("blockSize: %u\r\n", fs_info.blockSize);
  PRINT("pageSize: %u\r\n", fs_info.pageSize);
  PRINT("maxOpenFiles: %u\r\n", fs_info.maxOpenFiles);
  PRINT("maxPathLength: %u\r\n", fs_info.maxPathLength);

  // start update firmware
  // Dir dir = SPIFFS.openDir("/");

  // pinMode(LED_BUILTIN, OUTPUT);
  // digitalWrite(LED_BUILTIN, LOW);

  if (SPIFFS.exists("/firmware.bin"))
  {
    File file = SPIFFS.open("/firmware.bin", "r");
    if (!file)
    {
      PRINT("Failed to open FIRMWARE file\r\n");
      file.close();
      return;
    }
    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH))
    { //start with max available size
      Update.printError(Serial);
      Serial.println("ERROR");
      file.close();
      return;
    }
    while (file.available())
    {
      uint8_t ibuffer[128];
      file.read((uint8_t *)ibuffer, 128);
      Serial.println((char *)ibuffer);
      Update.write(ibuffer, sizeof(ibuffer));
      // Serial.print("#");
    }
    Serial.print(Update.end(true));
    // digitalWrite(LED_BUILTIN, HIGH);
    file.close();
    SPIFFS.remove("/firmware.bin");
  }
  else
  {
    PRINT("Path to FIRMWARE file not exist.\r\n");
  }
  // end update firmware

#ifndef RELEASE
  { // List files
    //Dir dir = _fs->openDir("/");
    Dir dir = SPIFFS.openDir("/");
    while (dir.next())
    {
      String fileName = dir.fileName();
      size_t fileSize = dir.fileSize();

      PRINT("FS File: %s, size: %s\r\n", fileName.c_str(), formatBytes(fileSize));
    }
    PRINT("\r\n");
  }
#endif // RELEASE

  //save_config();

  if (!load_config_network())
  { // Try to load configuration from file system
    //defaultConfig(); // Load defaults if any error

    save_config_network();

    _configAP.APenable = true;
  }

  if (!load_config_location())
  {
    //create file if file not found
    save_config_location();
  }

  if (!load_config_time())
  {
    //create file if file not found
    save_config_time();
  }

  if (!load_config_sholat())
  {
    //create file if file not found
    save_config_sholat();
  }

  if (!load_config_ledmatrix())
  {
    //create file if file not found
    save_config_ledmatrix();
  }

  if (!load_config_httpauth())
  {
    //create file if file not found
  }

  //Set the host name
  char bufPrefix[] = "SHOLAT_";
  char bufChipId[11];
  itoa(ESP.getChipId(), bufChipId, 10);

  //char bufHostName[32];
  strlcpy(_config.hostname, bufPrefix, sizeof(_config.hostname));
  strncat(_config.hostname, bufChipId, sizeof(bufChipId));

  //  loadHTTPAuth();

  // _configAP.APenable = true;

  // WiFi.persistent(true);
  // WiFi.mode(WIFI_OFF);

  // bool autoConnect = false;
  // WiFi.setAutoConnect(autoConnect);

  // bool autoReconnect = true;
  // WiFi.setAutoReconnect(autoReconnect);

  WiFi.hostname(_config.hostname);

  WiFi.mode(WIFI_OFF);

  WiFi.setAutoConnect(autoConnect);
  WiFi.setAutoReconnect(autoReconnect);

  if (_configAP.APenable || strcmp(_config.ssid, "") == 0)
  {
    PRINT("Starting wifi in WIFI_AP mode.\r\n");
    // WiFi.mode(WIFI_OFF);
    // WiFi.mode(WIFI_AP); // bikin error
    WiFi.softAP(_configAP.ssid, _configAP.password);
    WiFi.softAPConfig(IPAddress(192, 168, 4, 1), IPAddress(192, 168, 4, 1), IPAddress(255, 255, 255, 0));
  }
  else if (!_configAP.APenable)
  {
    if (!_config.dhcp)
    {
      PRINT("DHCP disabled, starting wifi in WIFI_STA mode with static IP.\r\n");
      // WiFi.mode(WIFI_OFF);
      // WiFi.mode(WIFI_STA);

      IPAddress static_ip;
      IPAddress gateway;
      IPAddress netmask;
      IPAddress dns0;
      IPAddress dns1;

      static_ip.fromString(_config.static_ip);
      gateway.fromString(_config.gateway);
      netmask.fromString(_config.netmask);
      dns0.fromString(_config.dns0);
      dns1.fromString(_config.dns1);

      WiFi.config(static_ip, gateway, netmask, dns0, dns1);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      // WiFi.waitForConnectResult();
    }
    else
    {
      PRINT("Starting wifi in WIFI_STA mode.\r\n");
      // WiFi.mode(WIFI_OFF);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
      // WiFi.waitForConnectResult();
    }
  }

  dnsServer.start(53, "*", WiFi.softAPIP());

  // MDNS.addService("http", "tcp", 80);

  ArduinoOTA.setHostname(_config.hostname);
  ArduinoOTA.begin();

  NBNS.begin(_config.hostname);

  DEBUGASYNCWS("Starting SSDP...\r\n");
  SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
  SSDP.setHTTPPort(80);
  SSDP.setDeviceType(FPSTR(pgm_upnprootdevice));
  //  SSDP.setModelName(_config.deviceName.c_str());
  //  SSDP.setModelNumber(FPSTR(modelNumber));
  SSDP.begin();

  // // SSDP.setSchemaURL("description.xml");
  // SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
  // SSDP.setHTTPPort(80);
  // SSDP.setName("Philips hue clone");
  // SSDP.setSerialNumber("001788102201");
  // SSDP.setURL("index.html");
  // SSDP.setModelName("Philips hue bridge 2012");
  // SSDP.setModelNumber("929000226503");
  // SSDP.setModelURL("http://www.meethue.com");
  // SSDP.setManufacturer("Royal Philips Electronics");
  // SSDP.setManufacturerURL("http://www.philips.com");
  // SSDP.begin();

  //SPIFFS.begin();

  ws.onEvent(onWsEvent);

  server.addHandler(&ws);

  events.onConnect([](AsyncEventSourceClient *client) {
    //client->send("hello!", NULL, millis(), 1000);
    if (client->lastId())
    {
      PRINT("Client reconnected! Last message ID that it gat is: %u\r\n", client->lastId());
    }
    //send event with message "hello!", id current millis
    // and set reconnect delay to 1 second
    //client->send("hello!", NULL, millis(), 1000);
    client->send("hello!");
    //EVENTS_send_information_values_html(client);

    if (clientVisitStatusSystemPage)
    {
      // EventSendSystemStatus();
    }

    eventsourceTriggered = true;

