minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
    root[FPSTR(pgm_loc)] = _configLocation.district;
    //  root[FPSTR(pgm_day)] = dayNameStr(weekday(local_time()));
    //  root[FPSTR(pgm_date)] = getDateStr(local_time());
    root[FPSTR(pgm_fajr)] = sholatTimeArray[0];
    root[FPSTR(pgm_syuruq)] = sholatTimeArray[1];
    root[FPSTR(pgm_dhuhr)] = sholatTimeArray[2];
    root[FPSTR(pgm_ashr)] = sholatTimeArray[3];
    root[FPSTR(pgm_maghrib)] = sholatTimeArray[5];
    root[FPSTR(pgm_isya)] = sholatTimeArray[6];

    size_t len = root.measureLength();
    char buf[len + 1];
    root.printTo(buf, len + 1);
    request->send(200, "text/plain", buf);
  });

  server.on("/status/network", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    StaticJsonBuffer<1024> jsonBuffer;
    JsonObject &root = jsonBuffer.createObject();

    root[FPSTR(pgm_chipid)] = ESP.getChipId();
    root[FPSTR(pgm_hostname)] = WiFi.hostname();
    root[FPSTR(pgm_status)] = FPSTR(wifistatus_P[WiFi.status()]);

    root[FPSTR(pgm_mode)] = FPSTR(wifimode_P[WiFi.getMode()]);
    const char *phymodes[] = {"", "B", "G", "N"};
    root[FPSTR(pgm_phymode)] = phymodes[WiFi.getPhyMode()];
    root[FPSTR(pgm_channel)] = WiFi.channel();
    root[FPSTR(pgm_ssid)] = WiFi.SSID();
    root[FPSTR(pgm_password)] = WiFi.psk();
    root[FPSTR(pgm_encryption)] = WiFi.encryptionType(0);
    root[FPSTR(pgm_isconnected)] = WiFi.isConnected();
    root[FPSTR(pgm_autoconnect)] = WiFi.getAutoConnect();
    root[FPSTR(pgm_persistent)] = WiFi.getPersistent();
    root[FPSTR(pgm_bssid)] = WiFi.BSSIDstr();
    root[FPSTR(pgm_rssi)] = WiFi.RSSI();
    root[FPSTR(pgm_sta_ip)] = WiFi.localIP().toString();
    root[FPSTR(pgm_sta_mac)] = WiFi.macAddress();
    root[FPSTR(pgm_ap_ip)] = WiFi.softAPIP().toString();
    root[FPSTR(pgm_ap_mac)] = WiFi.softAPmacAddress();
    root[FPSTR(pgm_gateway)] = WiFi.gatewayIP().toString();
    root[FPSTR(pgm_netmask)] = WiFi.subnetMask().toString();
    root[FPSTR(pgm_dns0)] = WiFi.dnsIP().toString();
    root[FPSTR(pgm_dns1)] = WiFi.dnsIP(1).toString();

    size_t len = root.measureLength();
    char response[len + 1];
    root.printTo(response, len + 1);
    request->send(200, "text/plain", response);
  });

  server.on("/status/datetime", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    StaticJsonBuffer<768> jsonBuffer;
    JsonObject &root = jsonBuffer.createObject();

    RtcDateTime dt;
    dt.InitWithEpoch32Time(localTime);

    root["d"] = dt.Day();
    root["m"] = dt.Month();
    root["y"] = dt.Year();
    root["hr"] = dt.Hour();
    root["min"] = dt.Minute();
    root["sec"] = dt.Second();
    // root["tz"] = TimezoneFloat();
    root["tzStr"] = _configLocation.timezonestring;
    root["utc"] = now;
    root["local"] = localTime;

    root[FPSTR(pgm_date)] = getDateStr(localTime);
    root[FPSTR(pgm_time)] = getTimeStr(localTime);
    root[FPSTR(pgm_uptime)] = getUptimeStr();
    root[FPSTR(pgm_lastboot)] = getLastBootStr();
    if (lastSync != 0)
    {
      root[FPSTR(pgm_lastsync)] = getLastSyncStr(lastSync);
      root[FPSTR(pgm_nextsync)] = getNextSyncStr();
    }
    else
    {
      root[FPSTR(pgm_lastsync)] = FPSTR(pgm_never);
      root[FPSTR(pgm_nextsync)] = getNextSyncStr();
    }

    if (lastSyncByNtp)
    {
      root[FPSTR(pgm_lastsyncbyntp)] = getLastSyncStr(lastSyncByNtp);
    }
    else
    {
      root[FPSTR(pgm_lastsyncbyntp)] = FPSTR(pgm_never);
    }

    if (lastSyncByRtc)
    {
      root[FPSTR(pgm_lastsyncbyrtc)] = getLastSyncStr(lastSyncByRtc);
    }
    else
    {
      root[FPSTR(pgm_lastsyncbyrtc)] = FPSTR(pgm_never);
    }

    root["ping_seq_num_send"] = ping_seq_num_send;
    root["ping_seq_num_recv"] = ping_seq_num_recv;

    size_t len = root.measureLength();
    char response[len + 1];
    root.printTo(response, sizeof(response));
    request->send(200, "text/plain", response);
  });

  server.on("/status/heap", [](AsyncWebServerRequest *request) {
    DEBUGASYNCWS("%s\r\n", request->url().c_str());

    uint32_t heap = ESP.getFreeHeap();

    StaticJsonBuffer<64> jsonBuffer;
    JsonObject &root = jsonBuffer.createObject();

    root[FPSTR(pgm_heap)] = heap;

    size_t len = root.measureLength();
    char response[len + 1];
    root.printTo(response, sizeof(response));
    request->send(200, "application/json", response);
  });

  // server.on("/status/datetime", [](AsyncWebServerRequest *request) {
  //   DEBUGASYNCWS("%s\r\n", request->url().c_str());

  //   StaticJsonBuffer<512> jsonBuffer;
  //   JsonObject &root = jsonBuffer.createObject();

  //   root[FPSTR(pgm_date)] = getDateStr(localTime);
  //   root[FPSTR(pgm_time)] = getTimeStr(localTime);
  //   root[FPSTR(pgm_uptime)] = getUptimeStr();
  //   root[FPSTR(pgm_lastboot)] = getLastBootStr();
  //   if (lastSync != 0)
  //   {
  //     root[FPSTR(pgm_lastsync)] = getLastSyncStr();
  //     root[FPSTR(pgm_nextsync)] = getNextSyncStr();
  //   }
  //   else
  //   {
  //     root[FPSTR(pgm_lastsync)] = FPSTR(pgm_never);
  //     root[FPSTR(pgm_nextsync)] = getNextSyncStr();
  //   }

  //   root["ping_seq_num_send"] = ping_seq_num_send;
  //   root["ping_seq_num_recv"] = ping_seq_num_recv;

  //   size_t len = root.measureLength();
  //   char response[len + 1];
  //   root.printTo(response, sizeof(response));
  //   request->send(200, "application/json", response);
  // });

  server.begin();

  save_system_info();
}

// -------------------------------------------------
// *** FUNCTIONS
// -------------------------------------------------
void onWiFiConnected(WiFiEventStationModeConnected data)
{
  PRINT("\r\nWifi Connected\r\n");
  wifiDisconnectedSince = 0;
  PRINT("WiFi status: %s\r\n", WiFi.status() == WL_CONNECTED ? "WL_CONNECTED" : String(WiFi.status()).c_str());
}

// Start NTP only after IP network is connected
void onWifiGotIP(WiFiEventStationModeGotIP ipInfo)
// void onWifiGotIP(const WiFiEventStationModeGotIP &event)
{
  wifiGotIpFlag = true;

  //Serial.printf_P(PSTR("\r\nWifi Got IP: %s\r\n"), ipInfo.ip.toString().c_str ());
  PRINT("\r\nWifi Got IP\r\n");
  // PRINT("IP Address:\t%s\r\n", WiFi.localIP().toString().c_str());
  PRINT("IP Address:\t%s\r\n", ipInfo.ip.toString().c_str());
}

void onWiFiDisconnected(WiFiEventStationModeDisconnected data)
{
  wifiDisconnectedFlag = true;
  PRINT("\r\nWifi disconnected.\r\n");
}

void onStationConnected(const WiFiEventSoftAPModeStationConnected &evt)
{
  stationConnectedFlag = true;

  PRINT("Station connected: %s\r\n", macToString(evt.mac));
}

void onStationDisconnected(const WiFiEventSoftAPModeStationDisconnected &evt)
{
  stationDisconnectedFlag = true;

  PRINT("Station disconnected: %s\r\n", macToString(evt.mac));
}

void onProbeRequestPrint(const WiFiEventSoftAPModeProbeRequestReceived &evt)
{
  // PRINT("Probe request from: %s, RSSI: %d\r\n", macToString(evt.mac), evt.rssi);
}

void onProbeRequestBlink(const WiFiEventSoftAPModeProbeRequestReceived &)
{
  // We can't use "delay" or other blocking functions in the event handler.
  // Therefore we set a flag here and then check it inside "loop" function.
  // blinkFlag = true;
}

