minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
void send_config_ledmatrix(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  // root[FPSTR(pgm_type)] = FPSTR(pgm_matrixconfig);
  root[FPSTR(pgm_pagemode0)] = _ledMatrixSettings.pagemode0;
  root[FPSTR(pgm_pagemode1)] = _ledMatrixSettings.pagemode1;
  root[FPSTR(pgm_pagemode2)] = _ledMatrixSettings.pagemode2;
  root[FPSTR(pgm_scrollrow_0)] = _ledMatrixSettings.scrollrow_0;
  root[FPSTR(pgm_scrollrow_1)] = _ledMatrixSettings.scrollrow_1;
  root[FPSTR(pgm_scrollspeed)] = _ledMatrixSettings.scrollspeed;
  root[FPSTR(pgm_brightness)] = _ledMatrixSettings.brightness;

  char temp[4];
  root[FPSTR(pgm_operatingmode)] = itoa(_ledMatrixSettings.operatingmode, temp, 10);
  if (_ledMatrixSettings.pagemode == Automatic)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_automatic);
  }
  else if (_ledMatrixSettings.pagemode == Manual)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_manual);
  }

  root[FPSTR(pgm_adzanwaittime)] = _ledMatrixSettings.adzanwaittime;
  root[FPSTR(pgm_iqamahwaittime)] = _ledMatrixSettings.iqamahwaittime;

  root.prettyPrintTo(*response);
  request->send(response);
}

void send_config_mqtt(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  AsyncResponseStream *response = request->beginResponseStream("application/json");
  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.createObject();

  root[FPSTR(pgm_mqtt_enabled)] = configMqtt.enabled;
  root[FPSTR(pgm_mqtt_server)] = configMqtt.server;
  root[FPSTR(pgm_mqtt_port)] = configMqtt.port;
  root[FPSTR(pgm_mqtt_user)] = configMqtt.user;
  root[FPSTR(pgm_mqtt_pass)] = configMqtt.pass;
  root[FPSTR(pgm_mqtt_clientid)] = _config.hostname;
  root[FPSTR(pgm_mqtt_keepalive)] = configMqtt.keepalive;
  root[FPSTR(pgm_mqtt_cleansession)] = configMqtt.cleansession;
  root[FPSTR(pgm_mqtt_lwttopicprefix)] = configMqtt.lwttopicprefix;
  root[FPSTR(pgm_mqtt_lwtqos)] = configMqtt.lwtqos;
  root[FPSTR(pgm_mqtt_lwtretain)] = configMqtt.lwtretain;
  root[FPSTR(pgm_mqtt_lwtpayload)] = configMqtt.lwtpayload;

  root.prettyPrintTo(*response);
  request->send(response);
}

void set_time_html(AsyncWebServerRequest *request)
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  //List all parameters
  int params = request->params();
  for (int i = 0; i < params; i++)
  {
    AsyncWebParameter *p = request->getParam(i);
    if (p->isFile())
    { //p->isPost() is also true
      Serial.printf("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
    }
    else if (p->isPost())
    {
      Serial.printf("POST[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
    }
    else
    {
      Serial.printf("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
    }
  }

  // //Check if GET parameter exists
  // if (request->hasParam("download"))
  //   AsyncWebParameter* p = request->getParam("download");

  // //Check if POST (but not File) parameter exists
  // if (request->hasParam("download", true))
  //   AsyncWebParameter* p = request->getParam("download", true);

  // //Check if FILE was uploaded
  // if (request->hasParam("download", true, true))
  //   AsyncWebParameter* p = request->getParam("download", true, true);

  //handleFileRead("/setrtctime.html", request);
  request->send(SPIFFS, request->url());
}

bool load_config_location()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config LOCATION file\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("config LOCATION file size: %d bytes\r\n", size);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);
  file.close();

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config LOCATION file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
#endif

  if (root[FPSTR(pgm_province)].success())
  {
    strlcpy(_configLocation.province, root[FPSTR(pgm_province)], sizeof(_configLocation.province));
  }
  if (root[FPSTR(pgm_regency)].success())
  {
    strlcpy(_configLocation.regency, root[FPSTR(pgm_regency)], sizeof(_configLocation.regency));
  }
  if (root[FPSTR(pgm_district)].success())
  {
    strlcpy(_configLocation.district, root[FPSTR(pgm_district)], sizeof(_configLocation.district));
  }
  // if (root[FPSTR(pgm_timezone)].success())
  // {
  //   _configLocation.timezone = root[FPSTR(pgm_timezone)];
  // }
  if (root[FPSTR(pgm_timezonestring)].success())
  {
    strlcpy(_configLocation.timezonestring, root[FPSTR(pgm_timezonestring)], sizeof(_configLocation.timezonestring));
  }
  if (root[FPSTR(pgm_latitude)].success())
  {
    _configLocation.latitude = root[FPSTR(pgm_latitude)];
  }
  if (root[FPSTR(pgm_longitude)].success())
  {
    _configLocation.longitude = root[FPSTR(pgm_longitude)];
  }

  DEBUGASYNCWS("\r\nConfig LOCATION loaded successfully.\r\n");
  DEBUGASYNCWS("province: %s\r\n", _configLocation.province);
  DEBUGASYNCWS("regency: %s\r\n", _configLocation.regency);
  DEBUGASYNCWS("district: %s\r\n", _configLocation.district);
  DEBUGASYNCWS("timezonestring: %s\r\n", _configLocation.timezonestring);
  DEBUGASYNCWS("latitude: %f\r\n", _configLocation.latitude);
  DEBUGASYNCWS("longitude: %f\r\n", _configLocation.longitude);

  return true;
}

bool load_config_network()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config file\r\n");
    file.close();
    return false;
  }

  // size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", file.size());

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(file);

  file.close();

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config NETWORK file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  // strlcpy(_config.hostname, root[FPSTR(pgm_hostname)], sizeof(_config.hostname));
  strlcpy(_config.ssid, root[FPSTR(pgm_ssid)], sizeof(_config.ssid));
  strlcpy(_config.password, root[FPSTR(pgm_password)], sizeof(_config.password));
  _config.dhcp = root[FPSTR(pgm_dhcp)];
  strlcpy(_config.static_ip, root[FPSTR(pgm_static_ip)], sizeof(_config.static_ip));
  strlcpy(_config.netmask, root[FPSTR(pgm_netmask)], sizeof(_config.netmask));
  strlcpy(_config.gateway, root[FPSTR(pgm_gateway)], sizeof(_config.gateway));
  strlcpy(_config.dns0, root[FPSTR(pgm_dns0)], sizeof(_config.dns0));
  strlcpy(_config.dns1, root[FPSTR(pgm_dns1)], sizeof(_config.dns1));

  DEBUGASYNCWS("\r\nNetwork settings loaded successfully.\r\n");
  DEBUGASYNCWS("hostname: %s\r\n", _config.hostname);
  DEBUGASYNCWS("ssid: %s\r\n", _config.ssid);
  DEBUGASYNCWS("pass: %s\r\n", _config.password);
  DEBUGASYNCWS("dhcp: %d\r\n", _config.dhcp);
  DEBUGASYNCWS("static_ip: %s\r\n", _config.static_ip);
  DEBUGASYNCWS("netmask: %s\r\n", _config.netmask);
  DEBUGASYNCWS("gateway: %s\r\n", _config.gateway);
  DEBUGASYNCWS("dns0: %s\r\n", _config.dns0);
  DEBUGASYNCWS("dns1: %s\r\n", _config.dns1);

