minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  return true;
}

//*************************
// LOAD CONFIG LEDMATRIX
//*************************
bool load_config_ledmatrix()
{
  DEBUGASYNCWS("\r\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open config LEDMATRIX file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size + 1];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse config LEDMATRIX file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");

#endif

  uint8_t op = root[FPSTR(pgm_operatingmode)];

  if (op == 0)
  {
    _ledMatrixSettings.operatingmode = Normal;
  }
  else if (op == 1)
  {
    _ledMatrixSettings.operatingmode = Config;
  }
  else if (op == 2)
  {
    _ledMatrixSettings.operatingmode = Edit;
  }

  const char *pagemode = root[FPSTR(pgm_pagemode)];
  int len = strlen(pagemode);
  if (strncmp_P(pagemode, pgm_automatic, len) == 0)
  {
    _ledMatrixSettings.pagemode = Automatic;
  }
  else
  {
    _ledMatrixSettings.pagemode = Manual;
  }

  _ledMatrixSettings.pagemode0 = root[FPSTR(pgm_pagemode0)];
  _ledMatrixSettings.pagemode1 = root[FPSTR(pgm_pagemode1)];
  _ledMatrixSettings.pagemode2 = root[FPSTR(pgm_pagemode2)];
  _ledMatrixSettings.scrollrow_0 = root[FPSTR(pgm_scrollrow_0)];
  _ledMatrixSettings.scrollrow_1 = root[FPSTR(pgm_scrollrow_1)];
  _ledMatrixSettings.scrollspeed = root[FPSTR(pgm_scrollspeed)];
  _ledMatrixSettings.brightness = root[FPSTR(pgm_brightness)];
  _ledMatrixSettings.adzanwaittime = root[FPSTR(pgm_adzanwaittime)];
  _ledMatrixSettings.iqamahwaittime = root[FPSTR(pgm_iqamahwaittime)];

  MODE = op;
  currentPageMode0 = _ledMatrixSettings.pagemode0;
  currentPageMode1 = _ledMatrixSettings.pagemode1;
  currentPageMode2 = _ledMatrixSettings.pagemode2;

  //check
  DEBUGASYNCWS("\r\nLEDMATRIX settings loaded successfully.\r\n");
  DEBUGASYNCWS("operatingmode: %d\r\n", _ledMatrixSettings.operatingmode);
  DEBUGASYNCWS("pagemode: %d\r\n", _ledMatrixSettings.pagemode);
  DEBUGASYNCWS("pagemode0: %d\r\n", _ledMatrixSettings.pagemode0);
  DEBUGASYNCWS("pagemode1: %d\r\n", _ledMatrixSettings.pagemode1);
  DEBUGASYNCWS("pagemode2: %d\r\n", _ledMatrixSettings.pagemode2);
  DEBUGASYNCWS("scrollrow_0: %d\r\n", _ledMatrixSettings.scrollrow_0);
  DEBUGASYNCWS("scrollrow_1: %d\r\n", _ledMatrixSettings.scrollrow_1);
  DEBUGASYNCWS("scrollspeed: %d\r\n", _ledMatrixSettings.scrollspeed);
  DEBUGASYNCWS("brightness: %d\r\n", _ledMatrixSettings.brightness);

  return true;
}

//*************************
// LOAD HTTPAUTH CONFIG
//*************************
bool load_config_httpauth()
{
  DEBUGASYNCWS("\r\n%s\r\n", __PRETTY_FUNCTION__);

  File file = SPIFFS.open("/secret.json", "r");
  if (!file)
  {
    DEBUGASYNCWS("Failed to open HTTPAUTH file\r\n");
    file.close();
    return false;
  }

  size_t size = file.size();
  DEBUGASYNCWS("JSON file size: %d bytes\r\n", size);

  // Allocate a buffer to store contents of the file
  char buf[size + 1];

  //copy file to buffer
  file.readBytes(buf, size);

  //add termination character at the end
  buf[size] = '\0';

  //close the file, save your memory, keep healthy :-)
  file.close();

  DynamicJsonBuffer jsonBuffer;
  JsonObject &root = jsonBuffer.parseObject(buf);

  if (!root.success())
  {
    DEBUGASYNCWS("Failed to parse json file\r\n");
    return false;
  }

#ifndef RELEASEASYNCWS
  root.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  if (
      !root[FPSTR(pgm_wwwauth)].success() ||
      !root[FPSTR(pgm_wwwuser)].success() ||
      !root[FPSTR(pgm_wwwpass)].success())
  {
    DEBUGASYNCWS("Failed to parse httpAuth json file\r\n");
    return false;
  }

  _httpAuth.auth = root[FPSTR(pgm_wwwauth)];
  strlcpy(_httpAuth.wwwUsername, root[FPSTR(pgm_wwwuser)], sizeof(_httpAuth.wwwUsername));
  strlcpy(_httpAuth.wwwPassword, root[FPSTR(pgm_wwwpass)], sizeof(_httpAuth.wwwPassword));

  //check
  DEBUGASYNCWS("httpAuth settings loaded successfully.\r\n");
  DEBUGASYNCWS("Read httpAuth settings from memory:\r\n");
  DEBUGASYNCWS("wwwauth: %d\r\n", _httpAuth.auth);
  DEBUGASYNCWS("wwwuser: %s\r\n", _httpAuth.wwwUsername);
  DEBUGASYNCWS("wwwpass: %s\r\n", _httpAuth.wwwPassword);

  return true;
}

//*************************
// SAVE NETWORK CONFIG
//*************************
bool save_config_network()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<1024> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();
  // json[FPSTR(pgm_hostname)] = _config.hostname;
  json[FPSTR(pgm_ssid)] = _config.ssid;
  json[FPSTR(pgm_password)] = _config.password;
  json[FPSTR(pgm_dhcp)] = _config.dhcp;
  json[FPSTR(pgm_static_ip)] = _config.static_ip;
  json[FPSTR(pgm_netmask)] = _config.netmask;
  json[FPSTR(pgm_gateway)] = _config.gateway;
  json[FPSTR(pgm_dns0)] = _config.dns0;
  json[FPSTR(pgm_dns1)] = _config.dns1;

  //TODO add AP data to html
  File file = SPIFFS.open(FPSTR(pgm_configfilenetwork), "w");

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  // EEPROM_write_char(eeprom_wifi_ssid_start, eeprom_wifi_ssid_size, _config.ssid);
  // EEPROM_write_char(eeprom_wifi_password_start, eeprom_wifi_password_size, wifi_password);

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE CONFIG LOCATION
//*************************
bool save_config_location()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();

  json[FPSTR(pgm_province)] = _configLocation.province;
  json[FPSTR(pgm_regency)] = _configLocation.regency;
  json[FPSTR(pgm_district)] = _configLocation.district;
  json[FPSTR(pgm_timezonestring)] = _configLocation.timezonestring;
  json[FPSTR(pgm_latitude)] = _configLocation.latitude;
  json[FPSTR(pgm_longitude)] = _configLocation.longitude;

  File file = SPIFFS.open(FPSTR(pgm_configfilelocation), "w");

#ifndef RELEASEASYNCWS
  json.prettyPrintTo(DEBUGPORT);
  DEBUGASYNCWS("\r\n");
#endif

  json.prettyPrintTo(file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE CONFIG TIME
//*************************
bool save_config_time()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonBuffer<512> jsonBuffer;
  JsonObject &json = jsonBuffer.createObject();

