minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  uint16_t wFirstChar;

  wText = 0;

  static uint16_t startPos = 0;
  static uint16_t endPos = 0;

  static int offset = 0;

  // calculate widht of first char
  while (file.available())
  {
    char c = file.read();
    buf[file.position() - 1] = c;
    buf[file.position()] = '\0';
    matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
    if (wTemp > matrix.width())
    {
      // startPos = file.position();
      endPos = file.position();
      break;
    }
  }

  char temp[2];
  temp[0] = buf[0];
  temp[1] = '\0';
  matrix.getTextBounds(temp, 0, 0, &x1Temp, &y1Temp, &wFirstChar, &hTemp);

  offset = -1;
  int i = -1;

  // file.seek(0, SeekSet);
  // startPos = file.position();

  // while (file.available())
  // {
  //   offset++;
  //   file.seek(offset, SeekSet);
  //   char temp[2];
  //   file.read((uint8_t *)temp, 1);
  //   temp[1] = '\0';

  //   buf[offset] = temp[0];
  //   buf[offset + 1] = '\0';

  //   matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //   if (wTemp > matrix.width())
  //   {
  //     break;
  //   }
  // }

  endPos = file.position();
  // buf[offset + 1] = '\0';
  PRINT("X: %5d, wFirstChar: %d, offset: %4d, startPos: %3d, endPos: %3d, string: %s\r\n", X, wFirstChar, offset, startPos, endPos, buf);

  offset = -1;
  matrix.print(buf);

  // if (offset > 10)
  // {

  //   offset = -1;
  // }

  // for (int i = 0; i < numberOfChunks; i++)
  // {
  // }

  // file.seek(offset, mode);
  // while (file.available())
  // {
  //   file.read();
  //   Serial.println(file.position());
  // }

  /*
  for (int i = 0; i < numberOfChunks; i++)
  {
    if (remainingChunks - chunkSize < 0)
    {
      chunkSize = remainingChunks;
    }
    file.read((uint8_t *)buf, chunkSize);
    buf[chunkSize] = '\0';

    //Convert UTF8-string to Extended ASCII
    //utf8ascii(buf);

    matrix.print(buf);

    //contents += String(buf);
    //strcat(contents, buf);
    //buf[0] = (char)0; // clear buffer
    remainingChunks = remainingChunks - chunkSize;
  }
  */

  //char* chr = const_cast<char*>(contents.c_str());
  //matrix.getTextBounds(chr, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //matrix.getTextBounds(contents, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  wText = wTemp;

  file.close();

  //contents = "";
  //return contents;

  //return F("success");
}

void load_running_text_2()
{
  File runningTextFile = SPIFFS.open(RUNNING_TEXT_FILE_2, "r");
  if (!runningTextFile)
  {
    DEBUGLOG("Failed to open running text file");
    //return F("failed");
    //    return false;
    return;
  }

  // this is going to get the number of bytes in the file and give us the value in an integer
  int fileSize = runningTextFile.size();
  //Serial.println(fileSize);
  //int chunkSize=1;
  int chunkSize = 512;
  //This is a character array to store a chunk of the file.
  //We'll store 1024 characters at a time
  // char contents[fileSize];
  char buf[chunkSize];
  int numberOfChunks = (fileSize / chunkSize) + 1;

  // int count = 0;
  int remainingChunks = fileSize;

  int16_t x1Temp, y1Temp;
  uint16_t wTemp, hTemp;

  wText = 0;

  for (int i = 0; i < numberOfChunks; i++)
  {
    if (remainingChunks - chunkSize < 0)
    {
      chunkSize = remainingChunks;
    }
    runningTextFile.read((uint8_t *)buf, chunkSize);
    buf[chunkSize] = '\0';

    //Convert UTF8-string to Extended ASCII
    //utf8ascii(buf);

    matrix.print(buf);

    //contents += String(buf);
    //strcat(contents, buf);
    //buf[0] = (char)0; // clear buffer
    remainingChunks = remainingChunks - chunkSize;
  }

  //char* chr = const_cast<char*>(contents.c_str());
  //matrix.getTextBounds(chr, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //matrix.getTextBounds(contents, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  wText = wTemp;

  runningTextFile.close();

  //contents = "";
  //return contents;

  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  //return F("success");
}

char *formatBytes(size_t bytes)
{
  static char buf[10];
  if (bytes < 1024)
  {
    itoa(bytes, buf, 10);
    strcat(buf, "B");
  }
  else if (bytes < (1024 * 1024))
  {
    itoa(bytes / 1024.0, buf, 10);
    strcat(buf, "KB");
  }
  else if (bytes < (1024 * 1024 * 1024))
  {
    itoa(bytes / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "MB");
  }
  else
  {
    itoa(bytes / 1024.0 / 1024.0 / 1024.0, buf, 10);
    strcat(buf, "GB");
  }
  return buf;
}

bool loadHTTPAuth()
{
  DEBUGASYNCWS("%s\r\n", __PRETTY_FUNCTION__);

  File configFile = SPIFFS.open(SECRET_FILE, "r");
  if (!configFile)
  {
    DEBUGASYNCWS("Failed to open secret file\r\n");
    _httpAuth.auth = false;
    _httpAuth.wwwUsername[0] = '\0';
    _httpAuth.wwwPassword[0] = '\0';
    configFile.close();
    return false;
  }

  size_t size = configFile.size();

  // Allocate a buffer to store contents of the file.
  std::unique_ptr<char[]> buf(new char[size]);

  // We don't use String here because ArduinoJson library requires the input
  // buffer to be mutable. If you don't use ArduinoJson, you may as well
  // use configFile.readString instead.
  configFile.readBytes(buf.get(), size);
  configFile.close();
  DEBUGASYNCWS("JSON secret file size: %d bytes\r\n", size);
  DynamicJsonBuffer jsonBuffer;
  //StaticJsonBuffer<256> jsonBuffer;
  JsonObject &json = jsonBuffer.parseObject(buf.get());

  if (!json.success())
  {
#ifndef RELEASE
    //String temp;
    json.prettyPrintTo(DEBUGPORT);
    PRINT("\r\n");
    PRINT("Failed to parse secret file\r\n");
#endif // RELEASE
    _httpAuth.auth = false;
    return false;
  }
#ifndef RELEASE
  //String temp;
  json.prettyPrintTo(DEBUGPORT);
  PRINT("\r\n");
#endif // RELEASE

  _httpAuth.auth = json["auth"];
  strlcpy(_httpAuth.wwwUsername, json["user"], sizeof(_httpAuth.wwwUsername));
  strlcpy(_httpAuth.wwwPassword, json["pass"], sizeof(_httpAuth.wwwPassword));

  if (_httpAuth.auth)
  {
    DEBUGASYNCWS("User: %s\r\n", _httpAuth.wwwUsername);
    DEBUGASYNCWS("Pass: %s\r\n", _httpAuth.wwwPassword);
  }

