minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  return true;
}

void AsyncWSLoop()
{
  ArduinoOTA.handle();
  dnsServer.processNextRequest();

  // static time_t oldTime = localTime;
  //if (localTime != oldTime) {
  if (tick1000ms)
  {
    // send SSE if SSE client available
    // if (events.count())
    // {
    //   sendSholatSchedule(1);

    //   PRINT("\r\nNum of sse client: %d\r\n", events.count());
    // }

    if (firmwareUpdated)
    { // check the flag here to determine if a restart is required
      Serial.printf("Restarting ESP\n\r");
      firmwareUpdated = false;
      ESP.restart();
    }

    //if (ws.hasClient(clientID)) {
    if (!ws.enabled())
    {
      clientID = 0;
      clientVisitConfigRunningLedPage = false;
      clientVisitConfigSholatPage = false;
      clientVisitConfigMqttPage = false;
      clientVisitStatusNetworkPage = false;
      clientVisitStatusTimePage = false;
      clientVisitStatusSystemPage = false;
      clientVisitSetTimePage = false;
      clientVisitInfoPage = false;
      clientVisitSholatTimePage = false;
    }

    if (ws.hasClient(clientID))
    {
      if (clientVisitStatusNetworkPage)
      {
        // WsSendInfoDynamic(clientID);
        // EventSendNetworkStatus();
        // WsSendNetworkStatus();
        sendNetworkStatus(2);
      }
      else if (clientVisitStatusTimePage)
      {
        //WsSendInfoDynamic(clientID);
        // sendTimeStatus(2);
      }
      else if (clientVisitSholatTimePage)
      {
        sendSholatSchedule(2);
      }
      else if (clientVisitConfigRunningLedPage)
      {
        // do nothing
      }
      else if (clientVisitSetTimePage)
      {
        // sendDateTime(1);
        sendDateTime(2);
      }
    }
    else
    {
      clientID = 0;
      clientVisitConfigRunningLedPage = false;
      clientVisitConfigSholatPage = false;
      clientVisitConfigMqttPage = false;
      clientVisitStatusNetworkPage = false;
      clientVisitStatusTimePage = false;
      clientVisitStatusSystemPage = false;
      clientVisitSetTimePage = false;
      clientVisitInfoPage = false;
      clientVisitSholatTimePage = false;
    }

    static char ssid_old[sizeof(_config.ssid)];
    static char password_old[sizeof(_config.password)];
    static bool dhcp_old;
    static char static_ip_old[sizeof(_config.static_ip)];
    static char netmask_old[sizeof(_config.netmask)];
    static char gateway_old[sizeof(_config.gateway)];
    static char dns0_old[sizeof(_config.dns0)];
    static char dns1_old[sizeof(_config.dns1)];

    static bool doOnce = true;
    if (doOnce)
    {
      doOnce = false;
      strlcpy(ssid_old, _config.ssid, sizeof(ssid_old));
      strlcpy(password_old, _config.password, sizeof(password_old));
      dhcp_old = _config.dhcp;
      strlcpy(static_ip_old, _config.static_ip, sizeof(static_ip_old));
      strlcpy(netmask_old, _config.netmask, sizeof(netmask_old));
      strlcpy(gateway_old, _config.gateway, sizeof(gateway_old));
      strlcpy(dns0_old, _config.dns0, sizeof(dns0_old));
      strlcpy(dns1_old, _config.dns1, sizeof(dns1_old));
    }

    if (configFileNetworkUpdatedFlag)
    {
      configFileNetworkUpdatedFlag = false;

      if (strcmp(ssid_old, _config.ssid) != 0 ||
          strcmp(password_old, _config.password) != 0 ||
          dhcp_old != _config.dhcp ||
          strcmp(static_ip_old, _config.static_ip) != 0 ||
          strcmp(netmask_old, _config.netmask) != 0 ||
          strcmp(gateway_old, _config.gateway) != 0 ||
          strcmp(dns0_old, _config.dns0) != 0 ||
          strcmp(dns1_old, _config.dns1) != 0)
      {

        PRINT("\r\n*** Network Settings Updated ***\r\nApllying new settings...\r\n\r\n");

        // update old values
        strlcpy(ssid_old, _config.ssid, sizeof(ssid_old));
        strlcpy(password_old, _config.password, sizeof(password_old));
        dhcp_old = _config.dhcp;
        strlcpy(static_ip_old, _config.static_ip, sizeof(static_ip_old));
        strlcpy(netmask_old, _config.netmask, sizeof(netmask_old));
        strlcpy(gateway_old, _config.gateway, sizeof(gateway_old));
        strlcpy(dns0_old, _config.dns0, sizeof(dns0_old));
        strlcpy(dns1_old, _config.dns1, sizeof(dns1_old));

        if (!_config.dhcp)
        {
          PRINT("DHCP disabled, starting wifi in WIFI_STA mode with static IP.\r\n");
          WiFi.mode(WIFI_OFF);
          WiFi.mode(WIFI_STA);

          IPAddress static_ip;
          IPAddress gateway;
          IPAddress netmask;
          IPAddress dns0;
          IPAddress dns1;

          static_ip.fromString(_config.static_ip);
          gateway.fromString(_config.gateway);
          netmask.fromString(_config.netmask);
          dns0.fromString(_config.dns0);
          dns1.fromString(_config.dns1);

          WiFi.config(static_ip, gateway, netmask, dns0, dns1);
          WiFi.hostname(_config.hostname);
          WiFi.begin(_config.ssid, _config.password);
          // WiFi.waitForConnectResult();
        }
        else
        {
          if (_config.ssid)
          {
            WiFi.mode(WIFI_OFF);
            IPAddress zeroIp(0, 0, 0, 0);
            WiFi.config(zeroIp, zeroIp, zeroIp);
            WiFi.hostname(_config.hostname);
            WiFi.begin(_config.ssid, _config.password);
            // WiFi.waitForConnectResult();
          }
        }
      }
      else
      {
        if (WiFi.status() != WL_CONNECTED)
        {
          if (_config.ssid)
          {
            PRINT("\r\nApllying new NETWORK settings...\r\n\r\n");
            WiFi.mode(WIFI_OFF);
            IPAddress zeroIp(0, 0, 0, 0);
            WiFi.config(zeroIp, zeroIp, zeroIp);
            WiFi.hostname(_config.hostname);
            WiFi.begin(_config.ssid, _config.password);
            // WiFi.waitForConnectResult();
          }
        }
      }

      //beep
      tone1 = HIGH;
    }
  }

  if (tick3000ms)
  {
    if (clientVisitStatusSystemPage)
    {
      // sendHeap(2);
      // sendTimeStatus(2);
    }
  }

  if (wifiGotIpFlag)
  {
    wifiGotIpFlag = false;

    if (!ws.enabled())
    {
      ws.enable(true);
      // ws.hasClient();
      ws.closeAll();
    }

    WiFi.setAutoConnect(autoConnect);
    WiFi.setAutoReconnect(autoReconnect);

    uint8_t mode = WiFi.getMode();
    if (mode == WIFI_AP)
    {
      // const char* mode_string = PSTR(pgm_WIFI_AP);
      PRINT("\r\nWifi mode: WIFI_AP\r\n");
    }
    else if (mode == WIFI_STA)
    {
      PRINT("\r\nWifi mode: WIFI_STA\r\n");

      // PRINT("\r\nTurning Off Wifi Access Point...\r\n");
      // WiFi.softAPdisconnect(true);
    }
    else if (mode == WIFI_AP_STA)
    {
      PRINT("\r\nWifi mode: WIFI_AP_STA\r\n");

      PRINT("\r\nTurning Off Wifi Access Point...\r\n");
      // WiFi.softAPdisconnect(true);

      WiFi.mode(WIFI_OFF);

      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
    }
    else if (mode == WIFI_OFF)
    {
      PRINT("\r\nWifi mode: WIFI_OFF\r\n");
    }
    else
    {
      PRINT("\r\nWifi mode: UNKNOWN\r\n");
    }

